# VS Code extensions for both code-server (browser) and VS Code Server (Remote-SSH).
# Add/remove and run install-vscode-extensions.sh to sync.


# Java
vscjava.vscode-java-pack

# Python
ms-python.python
charliermarsh.ruff

# Go
golang.go

# Terraform / IaC
hashicorp.terraform

# General tooling
eamodio.gitlens
mhutchie.git-graph
tamasfe.even-better-toml
redhat.vscode-yaml
streetsidesoftware.code-spell-checker

# Editing
vscodevim.vim